# Indexing and Selecting Data

The axis labeling information in pandas objects serves many purposes:

- Identifies data (i.e. provides metadata) using known indicators, important for analysis, visualization, and interactive console display.
- Enables automatic and explicit data alignment.
- Allows intuitive getting and setting of subsets of the data set.

In this section, we will focus on the final point: namely, how to slice, dice, and generally get and set subsets of pandas objects. The primary focus will be on Series and DataFrame as they have received more development attention in this area.

## Different Choices for Indexing

## Basic

In [2]:
import pandas as pd
import numpy as np
dates = pd.date_range('1/1/2000', periods=8)

In [3]:
s = pd.Series(np.random.randn(8),index=dates)

In [14]:
df = pd.DataFrame(np.random.randn(8,3),index=dates,columns=['A','B','C'])

In [15]:
s

2000-01-01   -1.663648
2000-01-02    0.366022
2000-01-03   -0.132595
2000-01-04    0.540955
2000-01-05    1.481613
2000-01-06   -0.880020
2000-01-07    1.275641
2000-01-08    0.281669
Freq: D, dtype: float64

In [16]:
df

                   A         B         C
2000-01-01  0.978281 -0.703447 -0.187089
2000-01-02  1.504648 -0.557403  1.063819
2000-01-03 -0.448070 -0.292653 -1.350013
2000-01-04  0.225319 -2.217576  0.235241
2000-01-05  1.449365 -0.051438 -0.298934
2000-01-06  0.264629  0.753059 -1.148668
2000-01-07 -0.520685 -0.989616  0.680255
2000-01-08  1.021579  0.927614 -0.453427

In [17]:
s[dates[5]]

-0.8800198502626092

In [18]:
df['A']

2000-01-01    0.978281
2000-01-02    1.504648
2000-01-03   -0.448070
2000-01-04    0.225319
2000-01-05    1.449365
2000-01-06    0.264629
2000-01-07   -0.520685
2000-01-08    1.021579
Freq: D, Name: A, dtype: float64

In [19]:
df[1:2]

                   A         B         C
2000-01-02  1.504648 -0.557403  1.063819

In [20]:
df[['A','C']]

                   A         C
2000-01-01  0.978281 -0.187089
2000-01-02  1.504648  1.063819
2000-01-03 -0.448070 -1.350013
2000-01-04  0.225319  0.235241
2000-01-05  1.449365 -0.298934
2000-01-06  0.264629 -1.148668
2000-01-07 -0.520685  0.680255
2000-01-08  1.021579 -0.453427

In [21]:
df[['A','B']] = df[['B','A']] # can be used to swap in local set

In [22]:
df

                   A         B         C
2000-01-01 -0.703447  0.978281 -0.187089
2000-01-02 -0.557403  1.504648  1.063819
2000-01-03 -0.292653 -0.448070 -1.350013
2000-01-04 -2.217576  0.225319  0.235241
2000-01-05 -0.051438  1.449365 -0.298934
2000-01-06  0.753059  0.264629 -1.148668
2000-01-07 -0.989616 -0.520685  0.680255
2000-01-08  0.927614  1.021579 -0.453427

In [28]:
df.loc[:,['B','A']] = df[['A','B']]

In [29]:
df

                   A         B         C
2000-01-01 -0.703447  0.978281 -0.187089
2000-01-02 -0.557403  1.504648  1.063819
2000-01-03 -0.292653 -0.448070 -1.350013
2000-01-04 -2.217576  0.225319  0.235241
2000-01-05 -0.051438  1.449365 -0.298934
2000-01-06  0.753059  0.264629 -1.148668
2000-01-07 -0.989616 -0.520685  0.680255
2000-01-08  0.927614  1.021579 -0.453427

In [30]:
df.loc[:,['B','A']] = df[['A','B']].values

In [31]:
df

                   A         B         C
2000-01-01  0.978281 -0.703447 -0.187089
2000-01-02  1.504648 -0.557403  1.063819
2000-01-03 -0.448070 -0.292653 -1.350013
2000-01-04  0.225319 -2.217576  0.235241
2000-01-05  1.449365 -0.051438 -0.298934
2000-01-06  0.264629  0.753059 -1.148668
2000-01-07 -0.520685 -0.989616  0.680255
2000-01-08  1.021579  0.927614 -0.453427

## Attribute Access

In [32]:
sa = pd.Series([1,2,3],index=list('abc'))

In [33]:
dfa = df.copy()

In [34]:
sa.a

1

In [35]:
dfa.A

2000-01-01    0.978281
2000-01-02    1.504648
2000-01-03   -0.448070
2000-01-04    0.225319
2000-01-05    1.449365
2000-01-06    0.264629
2000-01-07   -0.520685
2000-01-08    1.021579
Freq: D, Name: A, dtype: float64

In [36]:
sa.a=5

In [37]:
sa

a    5
b    2
c    3
dtype: int64

In [38]:
dfa

                   A         B         C
2000-01-01  0.978281 -0.703447 -0.187089
2000-01-02  1.504648 -0.557403  1.063819
2000-01-03 -0.448070 -0.292653 -1.350013
2000-01-04  0.225319 -2.217576  0.235241
2000-01-05  1.449365 -0.051438 -0.298934
2000-01-06  0.264629  0.753059 -1.148668
2000-01-07 -0.520685 -0.989616  0.680255
2000-01-08  1.021579  0.927614 -0.453427

In [40]:
dfa.A = list(range(len(dfa.index))) # 只有当A事先存在时才可以使用

In [41]:
dfa

            A         B         C
2000-01-01  0 -0.703447 -0.187089
2000-01-02  1 -0.557403  1.063819
2000-01-03  2 -0.292653 -1.350013
2000-01-04  3 -2.217576  0.235241
2000-01-05  4 -0.051438 -0.298934
2000-01-06  5  0.753059 -1.148668
2000-01-07  6 -0.989616  0.680255
2000-01-08  7  0.927614 -0.453427

In [42]:
dfa.index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [43]:
dfa.columns

Index(['A', 'B', 'C'], dtype='object')

In [46]:
dfa['D'] = list(range(len(dfa.index))) # standard indexing 无论D事先是否存在都可以使用

In [47]:
dfa

            A  B         C  D
2000-01-01  0  0 -0.187089  0
2000-01-02  1  1  1.063819  1
2000-01-03  2  2 -1.350013  2
2000-01-04  3  3  0.235241  3
2000-01-05  4  4 -0.298934  4
2000-01-06  5  5 -1.148668  5
2000-01-07  6  6  0.680255  6
2000-01-08  7  7 -0.453427  7

## Slicing ranges

In [48]:
s

2000-01-01   -1.663648
2000-01-02    0.366022
2000-01-03   -0.132595
2000-01-04    0.540955
2000-01-05    1.481613
2000-01-06   -0.880020
2000-01-07    1.275641
2000-01-08    0.281669
Freq: D, dtype: float64

In [49]:
s[1] #对于slice可以使用这样的方式

0.3660215565001527

In [50]:
s[2]

-0.1325950047169363

In [51]:
s[:5]

2000-01-01   -1.663648
2000-01-02    0.366022
2000-01-03   -0.132595
2000-01-04    0.540955
2000-01-05    1.481613
Freq: D, dtype: float64

In [52]:
s[::-1]

2000-01-08    0.281669
2000-01-07    1.275641
2000-01-06   -0.880020
2000-01-05    1.481613
2000-01-04    0.540955
2000-01-03   -0.132595
2000-01-02    0.366022
2000-01-01   -1.663648
Freq: -1D, dtype: float64

**With DataFrame, slicing inside of [] slices the rows. This is provided largely as a convenience since it is such a common operation.**

In [53]:
df[:3]

                   A         B         C
2000-01-01  0.978281 -0.703447 -0.187089
2000-01-02  1.504648 -0.557403  1.063819
2000-01-03 -0.448070 -0.292653 -1.350013

In [54]:
df[::1]

                   A         B         C
2000-01-01  0.978281 -0.703447 -0.187089
2000-01-02  1.504648 -0.557403  1.063819
2000-01-03 -0.448070 -0.292653 -1.350013
2000-01-04  0.225319 -2.217576  0.235241
2000-01-05  1.449365 -0.051438 -0.298934
2000-01-06  0.264629  0.753059 -1.148668
2000-01-07 -0.520685 -0.989616  0.680255
2000-01-08  1.021579  0.927614 -0.453427

## Selection By Label

In [58]:
df = pd.DataFrame(np.random.randn(5,4), columns=list('ABCD'), index=[0,1,2,3,4])

In [60]:
df.loc[1:2]

          A         B         C         D
1  1.063090  0.232986  0.920414 -1.133746
2 -2.037453  1.342815  1.766813  0.490303

In [61]:
s1 = pd.Series(np.random.randn(6),index=list('abcdef'))

In [62]:
s1.loc['c':]

c   -0.938264
d    0.330678
e   -0.095610
f   -0.632515
dtype: float64

In [63]:
 s1.loc['b']

0.637460414704492

In [64]:
s1.loc['c':] = 0

In [65]:
s1

a   -0.588136
b    0.637460
c    0.000000
d    0.000000
e    0.000000
f    0.000000
dtype: float64

In [66]:
 df1 = pd.DataFrame(np.random.randn(6,4),
   ....:                    index=list('abcdef'),
   ....:                    columns=list('ABCD'))

In [67]:
df1

          A         B         C         D
a -0.570732 -0.386713 -0.197945  0.081863
b -0.895397  0.015630 -0.459142  0.092562
c  0.900162  1.213465  1.105571 -0.406196
d  0.630237  0.634878  0.292882  0.693059
e -1.053889 -0.217695 -0.171774  0.755071
f  1.083436 -1.377897  0.982746  1.139641

In [68]:
df1.loc[['a', 'b', 'd'], :]

          A         B         C         D
a -0.570732 -0.386713 -0.197945  0.081863
b -0.895397  0.015630 -0.459142  0.092562
d  0.630237  0.634878  0.292882  0.693059

In [69]:
df1.loc['d':, 'A':'C']

          A         B         C
d  0.630237  0.634878  0.292882
e -1.053889 -0.217695 -0.171774
f  1.083436 -1.377897  0.982746

In [70]:
df1.loc['a']

A   -0.570732
B   -0.386713
C   -0.197945
D    0.081863
Name: a, dtype: float64

In [71]:
df1.loc[:,'A']

a   -0.570732
b   -0.895397
c    0.900162
d    0.630237
e   -1.053889
f    1.083436
Name: A, dtype: float64

In [72]:
df1.loc['a']>0

A    False
B    False
C    False
D     True
Name: a, dtype: bool

In [73]:
df1.loc[:,df1.loc['a']>0] # 返回符合要求的那一列

          D
a  0.081863
b  0.092562
c -0.406196
d  0.693059
e  0.755071
f  1.139641

In [74]:
df1.loc[df1.loc[:,'A']>0]

          A         B         C         D
c  0.900162  1.213465  1.105571 -0.406196
d  0.630237  0.634878  0.292882  0.693059
f  1.083436 -1.377897  0.982746  1.139641

### slicing with labels

In [75]:
s = pd.Series(list('abcde'), index=[0,3,2,5,4])

In [76]:
s.loc[3:5]

3    b
2    c
5    d
dtype: object

## Selection by position

**当用切片时，超出范围不会报错，但是用单个标识则会产生错误**

In [77]:
s1 = pd.Series(np.random.randn(5), index=list(range(0,10,2)))

In [78]:
s1

0   -0.041247
2    0.149722
4   -1.301281
6    1.053058
8    0.577120
dtype: float64

In [79]:
s1.iloc[:3]

0   -0.041247
2    0.149722
4   -1.301281
dtype: float64

In [90]:
x = list('abcdef')

In [91]:
x

['a', 'b', 'c', 'd', 'e', 'f']

In [92]:
x[4:10]

['e', 'f']

In [93]:
x[8:10]

[]

In [94]:
x

['a', 'b', 'c', 'd', 'e', 'f']

In [95]:
s = pd.Series(x)

In [96]:
s.iloc[4:10]

4    e
5    f
dtype: object

In [97]:
s.iloc[8:10]

Series([], dtype: object)

In [98]:
dfl = pd.DataFrame(np.random.randn(5,2), columns=list('AB'))

In [99]:
dfl.iloc[:, 2:3]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [100]:
dfl.iloc[:, 1:3]

          B
0 -0.114707
1 -0.493051
2 -0.573750
3  0.016167
4  0.714152

## Selection by callable

In [101]:
df1 = pd.DataFrame(np.random.randn(6, 4),
   ....:                    index=list('abcdef'),
   ....:                    columns=list('ABCD'))

In [102]:
df1

          A         B         C         D
a -0.289941 -0.192566 -1.034188  0.744343
b  1.546946  0.796995  0.354401  0.084053
c  2.103625  1.130685  0.432154  0.884044
d  0.571492 -1.738901  0.384634  0.034292
e -1.306755  0.832543  0.750661 -1.393018
f  0.720343 -1.075291 -0.176093 -1.460643

In [103]:
df1.loc[:,lambda df:df.columns[0]]

a   -0.289941
b    1.546946
c    2.103625
d    0.571492
e   -1.306755
f    0.720343
Name: A, dtype: float64

In [104]:
dfl.A.loc[lambda s:s>0]

0    0.214034
1    0.354784
Name: A, dtype: float64

Using these methods / indexers, you can **chain data selection operations** without using temporary variable.

## Selecting Random Samples

In [105]:
s = pd.Series([0,1,2,3,4,5])

In [106]:
s.sample()

3    3
dtype: int64

In [107]:
s.sample(3)

5    5
1    1
2    2
dtype: int64

In [108]:
s.sample(frac=0.3)

5    5
1    1
dtype: int64

In [109]:
s = pd.Series([0,1,2,3,4,5])

In [110]:
s.sample(5)

2    2
1    1
4    4
0    0
5    5
dtype: int64

In [111]:
s.sample(5,replace=True)

5    5
4    4
3    3
3    3
2    2
dtype: int64

In [112]:
 df2 = pd.DataFrame({'col1':[9,8,7,6], 'weight_column':[0.5, 0.4, 0.1, 0]})

In [113]:
df2

   col1  weight_column
0     9            0.5
1     8            0.4
2     7            0.1
3     6            0.0

In [114]:
df2.sample(n = 3, weights = 'weight_column')

   col1  weight_column
1     8            0.4
0     9            0.5
2     7            0.1

In [115]:
df3 = pd.DataFrame({'col1':[1,2,3], 'col2':[2,3,4]})

In [116]:
df3.sample(n=1, axis=1)

   col1
0     1
1     2
2     3

In [117]:
df4 = pd.DataFrame({'col1':[1,2,3], 'col2':[2,3,4]})

In [118]:
df4.sample(n=2, random_state=2)

   col1  col2
2     3     4
1     2     3

In [119]:
df4.sample(n=2, random_state=2)

   col1  col2
2     3     4
1     2     3

## Setting With Enlargement

In [120]:
 se = pd.Series([1,2,3])

In [121]:
se[5] = 5
se

0    1
1    2
2    3
5    5
dtype: int64

In [122]:
dfi = pd.DataFrame(np.arange(6).reshape(3,2),
   .....:                 columns=['A','B'])

In [123]:
dfi['C'] = 5 #

In [124]:
dfi

   A  B  C
0  0  1  5
1  2  3  5
2  4  5  5

In [125]:
dfi.loc[:,'D'] = dfi.A

In [126]:
dfi

   A  B  C  D
0  0  1  5  0
1  2  3  5  2
2  4  5  5  4

## Fast scalar value getting and setting

**at,iat** **可以增加新的元素，若该元素不存在原来的DF中时**

In [127]:
df

          A         B         C         D
0 -0.496209 -1.708734  0.187987  0.226906
1  1.063090  0.232986  0.920414 -1.133746
2 -2.037453  1.342815  1.766813  0.490303
3 -0.056994 -0.128800  0.169141  0.293677
4  1.509271 -0.140946 -0.416746 -0.749170

In [128]:
df.at[0,'A']

-0.49620926722979447

In [129]:
df.iat[0,1] # can enlarge the DF

-1.7087341874026194

## Boolean indexing

Another common operation is the use of boolean vectors to **filter the data**.

**& for and ; | for or ; ~ for not**

In [130]:
s = pd.Series(range(-3, 4))

In [131]:
s[s>0]

4    1
5    2
6    3
dtype: int64

In [132]:
s[(s<-1) | (s>0.5)]

0   -3
1   -2
4    1
5    2
6    3
dtype: int64

In [133]:
df

          A         B         C         D
0 -0.496209 -1.708734  0.187987  0.226906
1  1.063090  0.232986  0.920414 -1.133746
2 -2.037453  1.342815  1.766813  0.490303
3 -0.056994 -0.128800  0.169141  0.293677
4  1.509271 -0.140946 -0.416746 -0.749170

In [135]:
df[df['A']>0] # 选择的是行

          A         B         C         D
1  1.063090  0.232986  0.920414 -1.133746
4  1.509271 -0.140946 -0.416746 -0.749170

In [136]:
 df2 = pd.DataFrame({'a' : ['one', 'one', 'two', 'three', 'two', 'one', 'six'],
   .....:                     'b' : ['x', 'y', 'y', 'x', 'y', 'x', 'x'],
   .....:                     'c' : np.random.randn(7)})

In [137]:
df2

       a  b         c
0    one  x  0.570587
1    one  y -0.349038
2    two  y -0.569704
3  three  x  2.053110
4    two  y  1.723441
5    one  x  0.477817
6    six  x  0.050243

In [138]:
criterion = df2['a'].map(lambda x: x.startswith('t'))

In [139]:
criterion

0    False
1    False
2     True
3     True
4     True
5    False
6    False
Name: a, dtype: bool

In [141]:
df2[[True,False]*3 + [True]] # 就是接受一系列的True False True对应选择该 行，False对应不要选择该行

     a  b         c
0  one  x  0.570587
2  two  y -0.569704
4  two  y  1.723441
6  six  x  0.050243

In [145]:
df2[(lambda df:df['c']>0)] # 就是一个产生True或者False的函数

       a  b         c
0    one  x  0.570587
3  three  x  2.053110
4    two  y  1.723441
5    one  x  0.477817
6    six  x  0.050243

## Indexing with isin

In [146]:
s = pd.Series(np.arange(5), index=np.arange(5)[::-1], dtype='int64')

In [147]:
s.isin([4,5,6])

4    False
3    False
2    False
1    False
0     True
dtype: bool

In [148]:
s[s.isin([2,4,6])]

2    2
0    4
dtype: int64

In [149]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [150]:
s.reindex([2, 4, 6])

2    2.0
4    0.0
6    NaN
dtype: float64

In [151]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [152]:
df = pd.DataFrame({'vals': [1, 2, 3, 4], 'ids': ['a', 'b', 'f', 'n'],
   .....:                    'ids2': ['a', 'n', 'c', 'n']})

In [153]:
df.isin(['a','b',1,3])

    vals    ids   ids2
0   True   True   True
1  False   True  False
2   True  False  False
3  False  False  False

In [154]:
values = {'ids': ['a', 'b'], 'vals': [1, 3]}

In [155]:
df.isin(values)

    vals    ids   ids2
0   True   True  False
1  False   True  False
2   True  False  False
3  False  False  False

In [156]:
df

   vals ids ids2
0     1   a    a
1     2   b    n
2     3   f    c
3     4   n    n

In [157]:
values = {'ids': ['a', 'b'], 'ids2': ['a', 'c'], 'vals': [1, 3]}

In [159]:
row_mask = df.isin(values).all(1)

In [160]:
row_mask

0     True
1    False
2    False
3    False
dtype: bool

In [161]:
df[row_mask]

   vals ids ids2
0     1   a    a

## The where() Method and Masking

In [162]:
s

4    0
3    1
2    2
1    3
0    4
dtype: int64

In [163]:
s.where(s>0)

4    NaN
3    1.0
2    2.0
1    3.0
0    4.0
dtype: float64

In [166]:
s.where(s>3,-s)

4    0
3   -1
2   -2
1   -3
0    4
dtype: int64

In [167]:
s[s>3] = -s

In [168]:
s

4    0
3    1
2    2
1    3
0   -4
dtype: int64

In [169]:
dates = pd.date_range('1/1/2000', periods=8)

In [170]:
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])

In [171]:
df

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302 -0.570358  1.195742  1.240103
2000-01-04 -0.120411 -0.961789 -2.543466  1.457098
2000-01-05 -0.090086  0.939907  1.085964 -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523 -0.030852  1.094464 -1.166590

In [172]:
df[df<0]

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03       NaN -0.570358       NaN       NaN
2000-01-04 -0.120411 -0.961789 -2.543466       NaN
2000-01-05 -0.090086       NaN       NaN -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093       NaN       NaN       NaN
2000-01-08       NaN -0.030852       NaN -1.166590

In [173]:
df.where(df<0,-df)

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732 -0.837541
2000-01-02 -0.395517 -1.110958 -0.026976 -1.545888
2000-01-03 -0.378302 -0.570358 -1.195742 -1.240103
2000-01-04 -0.120411 -0.961789 -2.543466 -1.457098
2000-01-05 -0.090086 -0.939907 -1.085964 -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093 -0.237632 -0.607011 -0.358383
2000-01-08 -0.107523 -0.030852 -1.094464 -1.166590

In [174]:
df

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302 -0.570358  1.195742  1.240103
2000-01-04 -0.120411 -0.961789 -2.543466  1.457098
2000-01-05 -0.090086  0.939907  1.085964 -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523 -0.030852  1.094464 -1.166590

In [175]:
df2 = df.copy()

In [176]:
df2[df2<0] = 0

In [177]:
df2

                   A         B         C         D
2000-01-01  0.000000  0.000000  0.000000  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302  0.000000  1.195742  1.240103
2000-01-04  0.000000  0.000000  0.000000  1.457098
2000-01-05  0.000000  0.939907  1.085964  0.000000
2000-01-06  0.000000  0.000000  0.000000  0.000000
2000-01-07  0.000000  0.237632  0.607011  0.358383
2000-01-08  0.107523  0.000000  1.094464  0.000000

In [178]:
df3 = df.copy()

In [179]:
df3.where(df3>0,-df,inplace=True)

In [180]:
df3

                   A         B         C         D
2000-01-01  0.893277  0.578131  0.578732  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302  0.570358  1.195742  1.240103
2000-01-04  0.120411  0.961789  2.543466  1.457098
2000-01-05  0.090086  0.939907  1.085964  0.852806
2000-01-06  3.449686  0.935127  2.053991  0.867467
2000-01-07  2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523  0.030852  1.094464  1.166590

In [181]:
df2 = df.copy()

In [184]:
df2[df2[1:4]>0] = 3

In [185]:
df2

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732  0.837541
2000-01-02  3.000000  3.000000  3.000000  3.000000
2000-01-03  3.000000 -0.570358  3.000000  3.000000
2000-01-04 -0.120411 -0.961789 -2.543466  3.000000
2000-01-05 -0.090086  0.939907  1.085964 -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523 -0.030852  1.094464 -1.166590

In [188]:
df2 = df.copy()

In [189]:
df2

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302 -0.570358  1.195742  1.240103
2000-01-04 -0.120411 -0.961789 -2.543466  1.457098
2000-01-05 -0.090086  0.939907  1.085964 -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523 -0.030852  1.094464 -1.166590

In [191]:
df2.where(df2>0,df2['A'],axis='index') # 指定了一个子集，df[]

                   A         B         C         D
2000-01-01 -0.893277 -0.893277 -0.893277  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302  0.378302  1.195742  1.240103
2000-01-04 -0.120411 -0.120411 -0.120411  1.457098
2000-01-05 -0.090086  0.939907  1.085964 -0.090086
2000-01-06 -3.449686 -3.449686 -3.449686 -3.449686
2000-01-07 -2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523  0.107523  1.094464  0.107523

In [192]:
df2

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302 -0.570358  1.195742  1.240103
2000-01-04 -0.120411 -0.961789 -2.543466  1.457098
2000-01-05 -0.090086  0.939907  1.085964 -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523 -0.030852  1.094464 -1.166590

In [195]:
df2.apply(lambda x,y:x.where(x>0,y),y=df['A'])

                   A         B         C         D
2000-01-01 -0.893277 -0.893277 -0.893277  0.837541
2000-01-02  0.395517  1.110958  0.026976  1.545888
2000-01-03  0.378302  0.378302  1.195742  1.240103
2000-01-04 -0.120411 -0.120411 -0.120411  1.457098
2000-01-05 -0.090086  0.939907  1.085964 -0.090086
2000-01-06 -3.449686 -3.449686 -3.449686 -3.449686
2000-01-07 -2.474093  0.237632  0.607011  0.358383
2000-01-08  0.107523  0.107523  1.094464  0.107523

In [196]:
df3.where(lambda x: x > 4, lambda x: x + 10)

                    A          B          C          D
2000-01-01  10.893277  10.578131  10.578732  10.837541
2000-01-02  10.395517  11.110958  10.026976  11.545888
2000-01-03  10.378302  10.570358  11.195742  11.240103
2000-01-04  10.120411  10.961789  12.543466  11.457098
2000-01-05  10.090086  10.939907  11.085964  10.852806
2000-01-06  13.449686  10.935127  12.053991  10.867467
2000-01-07  12.474093  10.237632  10.607011  10.358383
2000-01-08  10.107523  10.030852  11.094464  11.166590

In [197]:
df.mask(df>=0)

                   A         B         C         D
2000-01-01 -0.893277 -0.578131 -0.578732       NaN
2000-01-02       NaN       NaN       NaN       NaN
2000-01-03       NaN -0.570358       NaN       NaN
2000-01-04 -0.120411 -0.961789 -2.543466       NaN
2000-01-05 -0.090086       NaN       NaN -0.852806
2000-01-06 -3.449686 -0.935127 -2.053991 -0.867467
2000-01-07 -2.474093       NaN       NaN       NaN
2000-01-08       NaN -0.030852       NaN -1.166590

## The query() Method

In [198]:
n = 10

In [199]:
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

In [200]:
df

          a         b         c
0  0.082963  0.422307  0.174730
1  0.949430  0.151795  0.990563
2  0.252796  0.060359  0.964969
3  0.628202  0.795964  0.010475
4  0.623040  0.774985  0.050852
5  0.057688  0.117674  0.356636
6  0.357306  0.364471  0.353509
7  0.340125  0.444639  0.236402
8  0.594075  0.054618  0.309746
9  0.448207  0.147484  0.843027

In [205]:
df[(df['a']<df['b']) & (df.b<df.c)]

          a         b         c
5  0.057688  0.117674  0.356636

In [206]:
df.query('(a<b) & (b<c)')

          a         b         c
5  0.057688  0.117674  0.356636

In [207]:
df = pd.DataFrame(np.random.randint(n / 2, size=(n, 2)), columns=list('bc'))

In [208]:
df

   b  c
0  3  0
1  4  2
2  1  1
3  1  1
4  0  0
5  1  0
6  1  2
7  3  2
8  2  3
9  1  1

In [209]:
df.index.name = 'a'

In [210]:
df

   b  c
a
0  3  0
1  4  2
2  1  1
3  1  1
4  0  0
5  1  0
6  1  2
7  3  2
8  2  3
9  1  1

In [212]:
df.query('a>b & b<c')

   b  c
a
6  1  2
8  2  3

In [213]:
df = pd.DataFrame(np.random.randint(n, size=(n, 2)), columns=list('bc'))

In [214]:
df

   b  c
0  7  2
1  9  7
2  4  6
3  0  3
4  3  8
5  2  1
6  1  6
7  3  4
8  2  6
9  8  5

In [215]:
df.query('index<b<c')

   b  c
2  4  6

In [216]:
df = pd.DataFrame({'a': np.random.randint(5, size=5)})

In [218]:
df.index.name = 'a'

In [219]:
df.query('a > 2')

   a
a
2  4

In [220]:
df.query('index > 2')

   a
a
3  0
4  1

### query() Use Cases

In [221]:
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

In [222]:
df

          a         b         c
0  0.621203  0.752447  0.690961
1  0.505707  0.908893  0.896461
2  0.432324  0.232241  0.715989
3  0.329767  0.414178  0.247944
4  0.475207  0.851453  0.429323
5  0.854620  0.640537  0.773520
6  0.028210  0.122991  0.301857
7  0.592106  0.227592  0.659785
8  0.718471  0.727457  0.380100
9  0.173959  0.469412  0.158034

In [223]:
df2 = pd.DataFrame(np.random.rand(n + 2, 3), columns=df.columns)

In [224]:
df2

           a         b         c
0   0.009126  0.709996  0.431368
1   0.096449  0.301674  0.568948
2   0.217893  0.357661  0.438705
3   0.969035  0.159640  0.042677
4   0.140758  0.297690  0.841742
5   0.185517  0.540200  0.976000
6   0.471844  0.882115  0.519391
7   0.681816  0.066160  0.440327
8   0.600570  0.950135  0.788213
9   0.091102  0.675304  0.916013
10  0.728580  0.783778  0.904523
11  0.582370  0.979695  0.883931

In [225]:
expr = '0.0 <= a <= c <= 0.5'

In [226]:
map(lambda frame: frame.query(expr), [df, df2])

In [228]:
list(map(lambda frame: frame.query(expr), [df, df2])) # 将函数map到列表中的每一个元素上

[         a         b         c
 6  0.02821  0.122991  0.301857,           a         b         c
 0  0.009126  0.709996  0.431368
 2  0.217893  0.357661  0.438705]

### query() Python versus pandas Syntax Comparison

In [229]:
df = pd.DataFrame(np.random.randint(n, size=(n, 3)), columns=list('abc'))

In [230]:
df

   a  b  c
0  3  4  1
1  0  4  9
2  8  1  2
3  1  4  4
4  2  8  6
5  4  1  3
6  7  2  8
7  6  4  5
8  3  0  6
9  4  6  6

In [231]:
df.query('(a < b) & (b < c)')

   a  b  c
1  0  4  9

In [232]:
df[(df.a < df.b) & (df.b < df.c)]

   a  b  c
1  0  4  9

In [233]:
df.query('a < b & b < c')

   a  b  c
1  0  4  9

In [234]:
df.query('a < b and b < c')

   a  b  c
1  0  4  9

In [235]:
df.query('a < b < c')

   a  b  c
1  0  4  9

### The in and not in operators

In [236]:
 df = pd.DataFrame({'a': list('aabbccddeeff'), 'b': list('aaaabbbbcccc'),
   .....:                    'c': np.random.randint(5, size=12),
   .....:                    'd': np.random.randint(9, size=12)})

In [237]:
df

    a  b  c  d
0   a  a  0  4
1   a  a  2  3
2   b  a  3  5
3   b  a  4  0
4   c  b  3  3
5   c  b  1  3
6   d  b  3  7
7   d  b  3  7
8   e  c  2  5
9   e  c  2  3
10  f  c  3  2
11  f  c  1  3

In [238]:
df.query('a in b') # 返回能在b列中找到a

   a  b  c  d
0  a  a  0  4
1  a  a  2  3
2  b  a  3  5
3  b  a  4  0
4  c  b  3  3
5  c  b  1  3

In [239]:
df[df.a.isin(df.b)]

   a  b  c  d
0  a  a  0  4
1  a  a  2  3
2  b  a  3  5
3  b  a  4  0
4  c  b  3  3
5  c  b  1  3

In [240]:
df.query('a not in b')

    a  b  c  d
6   d  b  3  7
7   d  b  3  7
8   e  c  2  5
9   e  c  2  3
10  f  c  3  2
11  f  c  1  3

In [241]:
df[~df.a.isin(df.b)]

    a  b  c  d
6   d  b  3  7
7   d  b  3  7
8   e  c  2  5
9   e  c  2  3
10  f  c  3  2
11  f  c  1  3

In [242]:
df.query('a in b and c < d')

   a  b  c  d
0  a  a  0  4
1  a  a  2  3
2  b  a  3  5
5  c  b  1  3

In [243]:
 df[df.b.isin(df.a) & (df.c < df.d)]

    a  b  c  d
0   a  a  0  4
1   a  a  2  3
2   b  a  3  5
5   c  b  1  3
6   d  b  3  7
7   d  b  3  7
8   e  c  2  5
9   e  c  2  3
11  f  c  1  3

### Special use of the == operator with list objects

In [244]:
df.query('b == ["a", "b", "c"]')

    a  b  c  d
0   a  a  0  4
1   a  a  2  3
2   b  a  3  5
3   b  a  4  0
4   c  b  3  3
5   c  b  1  3
6   d  b  3  7
7   d  b  3  7
8   e  c  2  5
9   e  c  2  3
10  f  c  3  2
11  f  c  1  3

In [245]:
df[df.b.isin(["a", "b", "c"])]

    a  b  c  d
0   a  a  0  4
1   a  a  2  3
2   b  a  3  5
3   b  a  4  0
4   c  b  3  3
5   c  b  1  3
6   d  b  3  7
7   d  b  3  7
8   e  c  2  5
9   e  c  2  3
10  f  c  3  2
11  f  c  1  3

In [246]:
df.query('c == [1, 2]')

    a  b  c  d
1   a  a  2  3
5   c  b  1  3
8   e  c  2  5
9   e  c  2  3
11  f  c  1  3

In [247]:
df.query('c != [1, 2]')

    a  b  c  d
0   a  a  0  4
2   b  a  3  5
3   b  a  4  0
4   c  b  3  3
6   d  b  3  7
7   d  b  3  7
10  f  c  3  2

In [248]:
df.query('[1, 2] in c')

    a  b  c  d
1   a  a  2  3
5   c  b  1  3
8   e  c  2  5
9   e  c  2  3
11  f  c  1  3

In [249]:
df.query('[1, 2] not in c')

    a  b  c  d
0   a  a  0  4
2   b  a  3  5
3   b  a  4  0
4   c  b  3  3
6   d  b  3  7
7   d  b  3  7
10  f  c  3  2

In [250]:
df[df.c.isin([1,2])]

    a  b  c  d
1   a  a  2  3
5   c  b  1  3
8   e  c  2  5
9   e  c  2  3
11  f  c  1  3

### Boolean Operators

In [251]:
df = pd.DataFrame(np.random.rand(n, 3), columns=list('abc'))

In [252]:
df['bools'] = np.random.rand(len(df)) > 0.5

In [253]:
df

          a         b         c  bools
0  0.338478  0.183871  0.795553  False
1  0.194141  0.854989  0.064926  False
2  0.021220  0.118886  0.046523   True
3  0.320141  0.402145  0.693733   True
4  0.827657  0.423838  0.112065   True
5  0.608115  0.098614  0.692861   True
6  0.773981  0.177184  0.663853   True
7  0.139710  0.367151  0.681418  False
8  0.278264  0.505064  0.692959   True
9  0.588821  0.720519  0.344769  False

In [254]:
df.query('bools')

          a         b         c  bools
2  0.021220  0.118886  0.046523   True
3  0.320141  0.402145  0.693733   True
4  0.827657  0.423838  0.112065   True
5  0.608115  0.098614  0.692861   True
6  0.773981  0.177184  0.663853   True
8  0.278264  0.505064  0.692959   True

In [255]:
df.query('~bools')

          a         b         c  bools
0  0.338478  0.183871  0.795553  False
1  0.194141  0.854989  0.064926  False
7  0.139710  0.367151  0.681418  False
9  0.588821  0.720519  0.344769  False

In [256]:
df.query('not bools')

          a         b         c  bools
0  0.338478  0.183871  0.795553  False
1  0.194141  0.854989  0.064926  False
7  0.139710  0.367151  0.681418  False
9  0.588821  0.720519  0.344769  False

### Performance of query()

## Duplicate Data

In [257]:
df2 = pd.DataFrame({'a': ['one', 'one', 'two', 'two', 'two', 'three', 'four'],
   .....:                     'b': ['x', 'y', 'x', 'y', 'x', 'x', 'x'],
   .....:                     'c': np.random.randn(7)})
   .....:

In [258]:
df2

       a  b         c
0    one  x  0.148747
1    one  y -0.990458
2    two  x  1.013842
3    two  y -1.086416
4    two  x  0.480216
5  three  x -0.516141
6   four  x -0.739428

In [259]:
df2.duplicated('a')

0    False
1     True
2    False
3     True
4     True
5    False
6    False
dtype: bool

In [260]:
df2.duplicated('a', keep='last')

0     True
1    False
2     True
3     True
4    False
5    False
6    False
dtype: bool

In [261]:
df2.duplicated('a', keep=False)

0     True
1     True
2     True
3     True
4     True
5    False
6    False
dtype: bool

In [262]:
df2.drop_duplicates('a')

       a  b         c
0    one  x  0.148747
2    two  x  1.013842
5  three  x -0.516141
6   four  x -0.739428

In [263]:
df2.drop_duplicates('a', keep='last')

       a  b         c
1    one  y -0.990458
4    two  x  0.480216
5  three  x -0.516141
6   four  x -0.739428

In [264]:
df2.drop_duplicates('a', keep=False)

       a  b         c
5  three  x -0.516141
6   four  x -0.739428

In [265]:
df2.duplicated(['a', 'b'])

0    False
1    False
2    False
3    False
4     True
5    False
6    False
dtype: bool

In [266]:
df2.drop_duplicates(['a', 'b'])

       a  b         c
0    one  x  0.148747
1    one  y -0.990458
2    two  x  1.013842
3    two  y -1.086416
5  three  x -0.516141
6   four  x -0.739428

In [267]:
df3 = pd.DataFrame({'a': np.arange(6),
   .....:                     'b': np.random.randn(6)},
   .....:                    index=['a', 'a', 'b', 'c', 'b', 'a'])

In [268]:
df3

   a         b
a  0  0.448138
a  1  0.180785
b  2 -0.353513
c  3  0.965182
b  4  1.043387
a  5 -0.036105

In [269]:
df3.index.duplicated()

array([False,  True, False, False,  True,  True])

In [270]:
df3[~df3.index.duplicated()]

   a         b
a  0  0.448138
b  2 -0.353513
c  3  0.965182

In [271]:
df3[~df3.index.duplicated(keep='last')]

   a         b
c  3  0.965182
b  4  1.043387
a  5 -0.036105

In [272]:
df3[~df3.index.duplicated(keep=False)]

   a         b
c  3  0.965182

## Dictionary-like get() method

In [273]:
s = pd.Series([1,2,3], index=['a','b','c'])

In [274]:
s.get('x', default=-1)

-1

## The lookup() Method

In [275]:
dflookup = pd.DataFrame(np.random.rand(20,4), columns = ['A','B','C','D'])

In [276]:
dflookup

           A         B         C         D
0   0.226946  0.922860  0.243115  0.703030
1   0.887845  0.128037  0.773667  0.951749
2   0.533238  0.779748  0.052768  0.322035
3   0.020563  0.801973  0.694474  0.635285
4   0.071076  0.202037  0.478546  0.779677
5   0.613671  0.280482  0.849117  0.766504
6   0.191895  0.693934  0.701792  0.300628
7   0.036325  0.054999  0.079942  0.428125
8   0.746647  0.536155  0.942867  0.892958
9   0.167448  0.375047  0.022989  0.523621
10  0.925045  0.597572  0.061151  0.827993
11  0.438103  0.409704  0.422629  0.516467
12  0.817930  0.431417  0.694631  0.616642
13  0.255412  0.016490  0.131696  0.192481
14  0.204324  0.052614  0.909381  0.884969
15  0.234592  0.975933  0.477306  0.591399
16  0.144546  0.331652  0.663244  0.645910
17  0.189675  0.826257  0.579782  0.138289
18  0.612191  0.781741  0.931711  0.087487
19  0.121662  0.221866  0.894703  0.383595

In [277]:
dflookup.lookup(list(range(0,10,2)), ['B','C','A','B','D'])

array([0.92285956, 0.05276814, 0.0710757 , 0.69393412, 0.89295819])

## Index objects

In [278]:
index = pd.Index(['e', 'd', 'a', 'b'])

In [279]:
index

Index(['e', 'd', 'a', 'b'], dtype='object')

In [280]:
'd' in index

True

In [281]:
index = pd.Index(['e', 'd', 'a', 'b'], name='something')

In [282]:
index

Index(['e', 'd', 'a', 'b'], dtype='object', name='something')

In [283]:
index.name

'something'

In [284]:
index = pd.Index(list(range(5)), name='rows')

In [285]:
columns = pd.Index(['A', 'B', 'C'], name='cols')

In [286]:
df = pd.DataFrame(np.random.randn(5, 3), index=index, columns=columns)

In [287]:
df

cols         A         B         C
rows
0     0.808978  0.367676  0.867045
1     1.234026 -0.925095 -0.137472
2     0.517799  0.144486 -1.531105
3    -0.836804 -0.061718  0.613809
4     0.849389 -0.775559  1.482293

In [288]:
df['A']

rows
0    0.808978
1    1.234026
2    0.517799
3   -0.836804
4    0.849389
Name: A, dtype: float64

### Setting metadata